TABLE = [167, 18, 245, 144, 124, 46, 63, 223, 154, 212, 97, 66, 141, 122, 195, 65,
         255, 5, 230, 183, 54, 203, 95, 143, 243, 250, 136, 37, 113, 9, 206, 225,
         68, 108, 87, 189, 246, 54, 61, 123]

inv29 = pow(29, -1, 256)   # обернений елемент для множення на 29 за модулем 256

def ror8(v, n):
    n &= 7
    return ((v >> n) | (v << (8 - n))) & 0xFF

flag = []
prev = 66
for t in TABLE:
    x = t ^ 0xA7
    x = ror8(x, 3)
    x = (x - 91) % 256
    x = (x * inv29) % 256
    flag.append(x ^ prev)
    prev = t   # для правильного прапора prev на наступному кроці = поточний TABLE[i]

print(bytes(flag).decode())
